[{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2aa"
  },
  "wid": "WKSP02",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop1",
  "alteredFee": 599,
  "actualFee": 599,
  "assnName": "Electrical & Electronics Engineering Association",
  "workName": "Edge AI Based Embedded System",
  "date": "15",
  "hall": "Applied Electronics Laboratory (E Block Ground Floor)",
  "time": "9.30 AM - 04.30 PM",
  "c1Name": "Kavinraj K",
  "c1Num": "9524816331",
  "c2Name": "Naveena M",
  "c2Num": "8148178425",
  "maxCount": "30",
  "closed": false,
  "desc": "This workshop aims to provide participants with a comprehensive understanding of ARM Cortex architecture, the integration of peripherals on STM32 microcontrollers, and the practical implementation of machine learning models using STM32 platforms in conjunction with CubeIDE. Participants will learn how to leverage the power of ARM Cortex cores and STM32 peripherals to develop and deploy machine learning applications on embedded systems, specifically targeting resource-constrained environments.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "Overview of ARM architecture and STM32"
        ]
      },
      {
        "time": "1:30 PM - 4:30 PM",
        "description": [
          "Implementation of Machine Learning Models on STM32"
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2ab"
  },
  "wid": "WKSP03",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop5",
  "alteredFee": 499,
  "actualFee": 499,
  "assnName": "IInformation Technology Association",
  "workName": "Crack The Code",
  "date": "15",
  "hall": "IT Main Lab - 1 (E Block 4th Floor)",
  "time": "9.30 AM - 12.30 PM",
  "c1Name": "Gayathri R",
  "c1Num": "9344512103",
  "c2Name": "Vishal K",
  "c2Num": "9443208357",
  "maxCount": "60",
  "closed": false,
  "desc": "\"Crack the Code\" by Dr. Anand from Amrita University is an engaging session on problem-solving and algorithmic thinking. Enhance your logical reasoning, creativity, and programming skills through interactive activities and live demos. This session will unveil innovative approaches to tackle complex coding challenges and master efficient algorithms.",
  "prerequisites": "Laptops have to be brought by the participants",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "Enhancing problem-solving and algorithmic thinking."
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2ac"
  },
  "wid": "WKSP13",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop2",
  "alteredFee": 849,
  "actualFee": 849,
  "assnName": "American Society of Mechanical Engineers",
  "workName": "Sensor Interface and Integration",
  "date": "15",
  "hall": "Sensorics Lab G 205, G 301",
  "time": "9.30 AM - 04.30 PM",
  "c1Name": "Mohamed Ashif P J",
  "c1Num": "6384272987",
  "c2Name": "Gokul C",
  "c2Num": "9944320475",
  "maxCount": "50",
  "closed": false,
  "desc": "In this Sensor Interface & Integration Workshop, students from various colleges were taught about Various sensors.They were given a brief introduction about the sensors. Then, they were taught to use the sensors using the Labview Software Interface. They were also given hands-on training & Manual to use the sensors.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "Introduction of Sensors"
        ]
      },
      {
        "time": "1:30 PM - 4:30 PM",
        "description": [
          "Segregation and performing practicals of the Sensors"
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2ad"
  },
  "wid": "WKSP05",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop9",
  "alteredFee": 499,
  "actualFee": 499,
  "assnName": "Electrical & Electronics Engineering Association",
  "workName": "Design and Analsyis of EV Traction Motor Systems",
  "date": "15",
  "hall": "J314",
  "time": "9.30 AM - 04.30 PM",
  "c1Name": "Varun Prasad M S",
  "c1Num": "9344910871",
  "c2Name": "Kaviya S V",
  "c2Num": "9360555418",
  "maxCount": "70",
  "closed": false,
  "desc": "This workshop provides an in-depth understanding of the design and sizing principles for power drives and drive trains in electric vehicle (EV) traction motor systems. Participants will explore key concepts related to motor selection, power drive design, and integration of drive train components to optimize EV performance.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "Design and Sizing of Power train"
        ]
      },
      {
        "time": "1:30 PM - 4:30 PM",
        "description": [
          "Design and sizing of Drive Train"
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2ae"
  },
  "wid": "WKSP06",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop7",
  "alteredFee": 649,
  "actualFee": 649,
  "assnName": "Instrumentation & Control Systems Engineering Association",
  "workName": "Cloud - Edge Systems in Industrial IoT Applications",
  "date": "15",
  "hall": "Y202",
  "time": "9.30 AM - 04.30 PM",
  "c1Name": "Ashwin T",
  "c1Num": "8610869652",
  "c2Name": "Sivarekha K",
  "c2Num": "6381045972",
  "maxCount": "60",
  "closed": false,
  "desc": "Dive into the world of Industrial IoT with this engaging workshop on Cloud and Edge systems. Learn the essentials of computing frameworks, including serial, edge, and cloud computing, and their role in real-time industrial applications. Experience hands-on sessions to master the integration of these technologies and unlock the potential of next-gen industrial systems.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 10:45 AM",
        "description": [
          "Introduction to types of computing in industrial scenario."
        ]
      },
      {
        "time": "11:00 AM - 12:30 PM",
        "description": [
          "Introduction to Serial computing in IIoT."
        ]
      },
      {
        "time": "01:30 PM - 3:00 PM",
        "description": [
          "Introduction to Edge computing in IIoT"
        ]
      },
      {
        "time": "3:15 PM to 4:30 PM",
        "description": [
          "Introduction to Cloud computing in IIoT"
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2af"
  },
  "wid": "WKSP11",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop4",
  "alteredFee": 299,
  "actualFee": 299,
  "assnName": "The Indian Institute of Metals (Students Affiliate Chapter)",
  "workName": "Laser Material Processing",
  "date": "15",
  "hall": "Y 201",
  "time": "9.30 AM - 04.30 PM",
  "c1Name": "Harish B",
  "c1Num": "90252 65168",
  "c2Name": "Madhumitha P",
  "c2Num": "9384416470",
  "maxCount": "30",
  "closed": false,
  "desc": "The Laser Material Processing Workshop is a comprehensive session designed to provide insights into laser-based manufacturing techniques like Selective Laser Melting (SLM) & Directed Energy Deposition (DED). The workshop includes a 3 hours lecture covering the principles, applications, and challenges of laser material processing, along with tools like GLEEBLE for thermal-mechanical testing. Following the lecture, participants will engage in hands-on ANSYS simulations to model processes such as heat transfers & residual stress analysis during laser processing. This workshop bridges theoretical knowledge with practical applications, offering a holistic learning experience.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 11:00 AM",
        "description": [
          "Lecture on SLM & DED"
        ]
      },
      {
        "time": "11:15AM - 12:30 PM",
        "description": [
          "Lecture on Thermo-mechanical simulations"
        ]
      },
      {
        "time": "1:30 PM - 4:30 PM",
        "description": [
          "Hands on Training - Ansys"
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2b0"
  },
  "wid": "WKSP08",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop3",
  "alteredFee": 349,
  "actualFee": 349,
  "assnName": "IEEE EMBS Student Branch",
  "workName": "MedXplore",
  "date": "15",
  "hall": "Medical Informatics lab",
  "time": "9.30 AM - 04.30 PM",
  "c1Name": "Mohana priya V M",
  "c1Num": "6382353714",
  "c2Name": "Hanishka K R",
  "c2Num": "7904257282",
  "maxCount": "50",
  "closed": false,
  "desc": "The workshop provides a comprehensive understanding of the principles, applications, and operational mechanisms of medical equipment. Participants will benefit from detailed explanations, coupled with an interactive hands-on session to enhance practical knowledge and technical skills. This initiative is tailored for individuals seeking to deepen their expertise in medical technology, instrumentation, and its applications in healthcare.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "Introduction to Medical equipments."
        ]
      },
      {
        "time": "1:30 PM - 4:00 PM",
        "description": [
          "Hands-on Session"
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2b1"
  },
  "wid": "WKSP12",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop8",
  "alteredFee": 449,
  "actualFee": 449,
  "assnName": "Biotechnology Association",
  "workName": "NEURONS TO NETWORK: Fundamentals of Computational Neuroscience ",
  "date": "15",
  "hall": "CC Lab",
  "time": "9.30 AM - 04.30 PM",
  "c1Name": "Sharumathi S",
  "c1Num": "8838758211",
  "c2Name": "Shwetha T",
  "c2Num": "9629274392",
  "maxCount": "90",
  "closed": false,
  "desc": "This workshop aims to equip participants with skills in using CellDesigner, NEURON, and MATLAB to model biological pathways, neurons, and brain circuits. It includes hands-on sessions to create and simulate pathways, neurons, and circuits, and to analyze data. Participants will learn how to apply these tools to solve real-life problems in biology and neuroscience.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "Introduction and tool such as CellDesigner, NEURON and MATLAB Simulink"
        ]
      },
      {
        "time": "1:30 PM - 4:30 PM",
        "description": [
          "Hands on Training and case studies"
        ]
      }
    ]
  ]
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2b2"
  },
  "wid": "WKSP14",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop10",
  "alteredFee": 800,
  "actualFee": 800,
  "assnName": "Computer Applications Association",
  "workName": "Introduction to GenAI and various GenAI models",
  "date": "15",
  "hall": "K504 with 50 to 60 people capacity",
  "time": "9:30 AM - 4:30 PM",
  "c1Name": "Mohan Prasath S",
  "c1Num": "9025802851",
  "c2Name": "Nivethithaa S",
  "c2Num": "9360377520",
  "maxCount": "50",
  "desc": "This workshop introduces participants to Generative AI, its underlying principles, and its applications in creating text, audio, and video content. It covers theoretical concepts and practical demonstrations, followed by hands-on sessions for applying learned skills.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "This session provides an in-depth introduction to Generative AI, including an overview of its capabilities and applications. Key topics include:\n\n1. Introduction to Generative AI and its significance.\n2. Concepts of prompt engineering and effective prompt creation.\n3. Types of generative AI (e.g., GPT, DALL·E, Stable Diffusion).\n4. Overview of various models and their architectures.\n5. Real-world applications of generative AI in content creation, marketing, and innovation.\nThe session includes live demonstrations to showcase practical use cases."
        ]
      },
      {
        "time": "2:00 PM to 5:00 PM",
        "description": [
          "This session focuses on practical implementation, where participants will apply generative AI techniques to create content. Key activities include:\n1. Text Content Generation: Creating blog posts, stories, and other text-based outputs using models like GPT.\n2. Audio Content Generation: Generating voiceovers, music, and synthesized audio using AI tools such as Descript or similar.\n3. Video Content Generation: Producing AI-generated videos, animations, or visual content using tools like Runway ML or similar platforms.\nParticipants will gain hands-on experience, enabling them to understand and leverage the capabilities of generative AI tools effectively."
        ]
      }
    ]
  ],
  "closed": false
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2b3"
  },
  "wid": "WKSP15",
  "image": "https://res.cloudinary.com/dvxgjje9e/image/upload/f_auto,q_auto/Workshop12",
  "alteredFee": 520,
  "actualFee": 520,
  "assnName": "Electronics & Communication Engg Association",
  "workName": "Touch Tech Unleashed: Mastering Displays in Hands-On Sessions",
  "date": "14",
  "hall": "embedded lab, ece department",
  "time": "9:30 AM - 4:30 PM",
  "c1Name": "Dwarkesh",
  "c1Num": "9444866750",
  "c2Name": "Dwarkesh",
  "c2Num": "9444866750",
  "maxCount": "40",
  "desc": "Unlock the potential of interactive touchscreen technology in our two-session workshop on DWIN Touch Screen Display Interfaces! Inspired by the advanced e-cockpit design from automobile industry, this workshop equips participants with the skills to seamlessly integrate touchscreens into their projects.\r\n\r\nOver the course of two sessions, you’ll learn to design, program, and implement custom interfaces using DWIN displays. From the fundamentals to hands-on project development, this workshop is your gateway to smarter and more interactive designs for applications ranging from automotive to IoT and beyond.",
  "agenda": [
    [
      {
        "time": "9:30 AM - 12:30 PM",
        "description": [
          "Dive into the world of touchscreen technology with an introduction to its applications and significance in modern smart devices. This session focuses on the fundamentals of touchscreen displays, exploring their architecture, setup, and basic programming. Participants will:\r\n-Learn how to connect and configure a touchscreen display.\r\n-Gain hands-on experience with firmware uploads and GUI tools.\r\n-Design a simple interactive interface using touchscreen software.\r\nBy the end of this session, you’ll have a functional understanding of touchscreen hardware and software, ready to take the next step toward building interactive projects."
        ]
      },
      {
        "time": "1:30 PM - 4:30 PM",
        "description": [
          "Take your skills to the next level by diving into advanced interface design and programming. This session emphasizes creating dynamic, interactive interfaces for real-world applications. Participants will:\r\n\r\n- Explore advanced GUI customization, including animations and widgets.\r\n- Learn to integrate communication protocols like UART for real-time interaction.\r\n- Build a mini-project such as a smart control panel or IoT dashboard.\r\n- Debug and optimize touchscreen performance for reliability.\r\nBy the end of this session, you'll have the expertise to design, code, and implement professional-grade touchscreen interfaces for various applications."
        ]
      }
    ]
  ],
  "closed": false
},
{
  "_id": {
    "$oid": "6798e7f4581dae6aaca0e2b4"
  },
  "wid": "WKSP16",
  "image": "https://res.cloudinary.com/disd40wdk/image/upload/v1708326450/oeeisfu3i2kczlld9viz.jpg",
  "alteredFee": 700,
  "actualFee": 700,
  "assnName": "Computer Science & Engg Association",
  "workName": "ARC - AI-driven Resilient Cybersecurity",
  "date": "15",
  "hall": "3AI Lab (E Block)",
  "time": "9:30 AM - 4:30 PM",
  "c1Name": "Aswin C",
  "c1Num": "7200052823",
  "c2Name": "Mahizha N S",
  "c2Num": "9629666039",
  "maxCount": "50",
  "desc": "This workshop is designed to introduce you to the fascinating intersection of AI and cybersecurity, with a focus on both the theoretical underpinnings and hands-on implementation of core concepts. We’ll dive into the latest trends and technologies, including:\n\n    Generative AI for creating and detecting adversarial attacks.\n    Federated Learning for secure, decentralized threat detection.\n    Homomorphic Encryption to train machine learning models while preserving data privacy.\n    Zero Trust Security Models powered by AI for adaptive, real-time threat detection.\n    AI-based Firewalls like FLARE (Federated Learning and Resilient Encryption) for dynamic response to cyberattacks.\n    Explainable AI (XAI) to build trust in security systems by making AI-driven decisions more transparent.\n    Large Language Models (LLMs) such as ChatGPT and Gemini for phishing detection and incident response.\n\nWhether you're a beginner or a tech enthusiast, this workshop will help you grasp the fundamentals through interactive sessions and hands-on labs. You’ll explore how AI can be trained to recognize cyber threats, how machine learning models can be used to classify malicious traffic, and how emerging tools like Secure Multi-Party Computation and Differential Privacy are revolutionizing the way we approach data protection.",
  "agenda": [
    [
      {
        "time": "9.30 AM - 12.30 PM",
        "description": [
          "The morning session will lay the groundwork for understanding cybersecurity and its critical role in today's digital\n landscape. Participants will spend the first 1.5 hours learning about various threats, vulnerabilities, and challenges\n faced by organizations in the ever-evolving cybersecurity domain. This will be followed by a detailed introduction to\n cyber defense and cyber threat intelligence (CTI), exploring proactive mechanisms for detecting and mitigating threats\n while leveraging intelligence for robust defense strategies. The session will conclude with a 30-minute hands-on\n exercise where participants will implement basic defense setups and experience real-world threat mitigation techniques."
        ]
      },
      {
        "time": "1.30 PM - 4.30 PM",
        "description": [
          "The afternoon session will introduce participants to the integration of AI/ML into cybersecurity, focusing on\n Privacy-Preserving Machine Learning (PPML) and Federated Learning (FL). During the first 1.5 hours, participants will\n explore these concepts in depth, understanding their methodologies and practical applications in safeguarding sensitive\n data and enhancing security. The second half of the session will be fully hands-on, allowing participants to engage in\n real-time testing of a Federated PPML system tailored for cybersecurity scenarios. This interactive segment will provide\n valuable insights into the performance and practical implementation of these advanced systems."
        ]
      }
    ]
  ],
  "closed": false
}]